# Redis Modules ν…μ¤νΈ κ°€μ΄λ“

## π€ 1λ‹¨κ³„: λ¨λ“ λ΅λ“

### Redis μ„λ²„ μ‹μ‘
```bash
cd /path/to/redis/src/modules

# λ¨λ“κ³Ό ν•¨κ» Redis μ„λ²„ μ‹μ‘
redis-server --loadmodule ./cachelock.so \
             --loadmodule ./taskqueue.so \
             --loadmodule ./distlock.so
```

λλ” λ°±κ·ΈλΌμ΄λ“λ΅ μ‹¤ν–‰:
```bash
redis-server --loadmodule ./cachelock.so \
             --loadmodule ./taskqueue.so \
             --loadmodule ./distlock.so \
             --daemonize yes \
             --logfile redis-modules.log
```

### λ¨λ“ λ΅λ“ ν™•μΈ
```bash
redis-cli MODULE LIST
```

μμƒ μ¶λ ¥:
```
1) 1) "name"
   2) "cachelock"
   3) "ver"
   4) (integer) 1
2) 1) "name"
   2) "taskqueue"
   3) "ver"
   4) (integer) 1
3) 1) "name"
   2) "distlock"
   3) "ver"
   4) (integer) 1
```

---

## π”’ 2λ‹¨κ³„: Cache Stampede Prevention ν…μ¤νΈ

### ν„°λ―Έλ„ 1 - ν΄λΌμ΄μ–ΈνΈ 1
```bash
redis-cli

# λ½ νλ“ μ‹λ„
> CACHE.LOCK user:1234 5000 10000
"LOAD"   # μ„±κ³µ! μ΄ ν΄λΌμ΄μ–ΈνΈκ°€ λ΅λ”

# 3μ΄ λ€κΈ° (DB λ΅λ”© μ‹λ®¬λ μ΄μ…)
# ... 3μ΄ ν›„ ...

# μΊμ‹μ— λ°μ΄ν„° μ €μ¥ (λ½ μλ™ ν•΄μ )
> CACHE.SET user:1234 "John Doe, age 30" 60000
"OK"
```

### ν„°λ―Έλ„ 2 - ν΄λΌμ΄μ–ΈνΈ 2 (λ™μ‹ μ‹¤ν–‰)
```bash
redis-cli

# κ°™μ€ ν‚¤μ— λ€ν•΄ λ½ νλ“ μ‹λ„ (ν΄λΌμ΄μ–ΈνΈ 1κ³Ό λ™μ‹)
> CACHE.LOCK user:1234 5000 10000
"WAIT"   # λ€κΈ°! λ‹¤λ¥Έ ν΄λΌμ΄μ–ΈνΈκ°€ λ΅λ”© μ¤‘

# 3μ΄ ν›„ λ‹¤μ‹ μ΅°ν
> CACHE.GET user:1234
"John Doe, age 30"   # ν΄λΌμ΄μ–ΈνΈ 1μ΄ μΊμ‹ν• λ°μ΄ν„°
```

### μΊμ‹ ννΈ ν…μ¤νΈ
```bash
redis-cli

> CACHE.GET user:1234
"John Doe, age 30"

> CACHE.GET user:9999
(nil)   # μ—†λ” ν‚¤
```

---

## π“¬ 3λ‹¨κ³„: Task Queue ν…μ¤νΈ

### Consumer Group μƒμ„±
```bash
redis-cli

> XGROUP CREATE tasks workers $ MKSTREAM
"OK"
```

### Producer - μ‘μ—… λ°ν–‰
```bash
redis-cli

> TASK.PUBLISH tasks "Process order #1001"
"1733658000000-0"

> TASK.PUBLISH tasks "Process order #1002"
"1733658001000-0"

> TASK.PUBLISH tasks "Process order #1003"
"1733658002000-0"

# λ°ν–‰λ μ‘μ—… ν™•μΈ
> XLEN tasks
(integer) 3
```

### Consumer 1 - μ‘μ—… μ†λΉ„
```bash
redis-cli

# 10κ° μ‘μ—…μ„ μµλ€ 5μ΄ λ™μ• λ€κΈ°ν•λ©° μ†λΉ„
> TASK.CONSUME workers consumer1 tasks 10 5000
1) 1) "tasks"
   2) 1) 1) "1733658000000-0"
         2) 1) "payload"
            2) "Process order #1001"
            3) "timestamp"
            4) "1733658000"
            5) "retry_count"
            6) "0"

# μ‘μ—… μ™„λ£ μ²λ¦¬
> TASK.ACK tasks workers 1733658000000-0
(integer) 1
```

### Consumer 2 - λ³‘λ ¬ μ†λΉ„
```bash
redis-cli

> TASK.CONSUME workers consumer2 tasks 10 5000
1) 1) "tasks"
   2) 1) 1) "1733658001000-0"
         2) ...   # λ‹¤λ¥Έ μ‘μ—… (μλ™ λ¶„λ°°λ¨)
```

### μ‹¤ν¨ λ° μ¬μ‹λ„ ν…μ¤νΈ
```bash
redis-cli

# Consumer Group μƒμ„± (retryμ©)
> XGROUP CREATE retry_tasks workers $ MKSTREAM
"OK"

> XGROUP CREATE dead_tasks workers $ MKSTREAM
"OK"

# μ‘μ—… μ‹¤ν¨ μ‹λ®¬λ μ΄μ… - μ¬μ‹λ„
> TASK.RETRY tasks "1733658002000-0" "Process order #1003" 0 retry_tasks dead_tasks 3
"OK"

# μ¬μ‹λ„ μ¤νΈλ¦Ό ν™•μΈ
> XLEN retry_tasks
(integer) 1

# 3λ² μ¬μ‹λ„ ν›„ dead letter μ΄λ™
> TASK.RETRY tasks "1733658002000-0" "Process order #1003" 3 retry_tasks dead_tasks 3
"OK"

> XLEN dead_tasks
(integer) 1
```

---

## π” 4λ‹¨κ³„: Distributed Lock ν…μ¤νΈ

### ν”„λ΅μ„Έμ¤ 1 - λ½ νλ“
```bash
redis-cli

> LOCK.ACQUIRE daily_job process1 30000
(integer) 1   # μ„±κ³µ!

# μ‘μ—… μ‹¤ν–‰ μ¤‘...
# (30μ΄ λ‚΄μ—)

# λ½ κ°±μ‹  (μ‘μ—…μ΄ κΈΈμ–΄μ§ κ²½μ°)
> LOCK.EXTEND daily_job process1 30000
(integer) 1   # κ°±μ‹  μ„±κ³µ

# μ‘μ—… μ™„λ£ ν›„ λ½ ν•΄μ 
> LOCK.RELEASE daily_job process1
(integer) 1
```

### ν”„λ΅μ„Έμ¤ 2 - λ™μ‹ λ½ μ‹λ„
```bash
redis-cli

# ν”„λ΅μ„Έμ¤ 1μ΄ λ½μ„ λ³΄μ  μ¤‘μΌ λ•
> LOCK.ACQUIRE daily_job process2 30000
(integer) 0   # μ‹¤ν¨! μ΄λ―Έ process1μ΄ λ³΄μ 

# ν”„λ΅μ„Έμ¤ 1μ΄ λ½μ„ ν•΄μ ν• ν›„
> LOCK.ACQUIRE daily_job process2 30000
(integer) 1   # μ΄μ  μ„±κ³µ!
```

### μλ»λ ν•΄μ  μ‹λ„ (λ³΄μ• ν…μ¤νΈ)
```bash
redis-cli

# process1μ΄ λ½ λ³΄μ  μ¤‘
> LOCK.RELEASE daily_job process2
(integer) 0   # μ‹¤ν¨! process2λ” κ¶ν• μ—†μ

# μ¬λ°”λ¥Έ μ‹λ³„μλ΅λ§ ν•΄μ  κ°€λ¥
> LOCK.RELEASE daily_job process1
(integer) 1   # μ„±κ³µ
```

---

## π§ 5λ‹¨κ³„: ν†µν•© μ‹λ‚λ¦¬μ¤ ν…μ¤νΈ

### μ‹λ‚λ¦¬μ¤: μ‚¬μ©μ ν”„λ΅ν•„ μΊμ‹± + μ‘μ—… μ²λ¦¬

```bash
# ν„°λ―Έλ„ 1: Cache + Queue Producer
redis-cli

# 1. μΊμ‹ ν™•μΈ
> CACHE.GET user:5678
(nil)

# 2. μΊμ‹ λ―Έμ¤ - λ½ νλ“
> CACHE.LOCK user:5678 5000 10000
"LOAD"

# 3. ν”„λ΅ν•„ λ΅λ“ μ‘μ—…μ„ νμ— λ°ν–‰
> TASK.PUBLISH profile_load_tasks "load_user:5678"
"1733658100000-0"

# 4. (DB λ΅λ“ ν›„) μΊμ‹μ— μ €μ¥
> CACHE.SET user:5678 "Jane Smith, age 25" 60000
"OK"
```

```bash
# ν„°λ―Έλ„ 2: Task Consumer + Lock
redis-cli

# 1. Consumer Group μƒμ„±
> XGROUP CREATE profile_load_tasks workers $ MKSTREAM
"OK"

# 2. λ°°μΉ μ‘μ—…μ© λ½ νλ“
> LOCK.ACQUIRE batch_profile_sync scheduler1 300000
(integer) 1

# 3. μ‘μ—… μ†λΉ„
> TASK.CONSUME workers worker1 profile_load_tasks 10 5000
1) ...

# 4. μ‘μ—… μ™„λ£
> TASK.ACK profile_load_tasks workers 1733658100000-0
(integer) 1

# 5. λ°°μΉ μ‘μ—… μ™„λ£ ν›„ λ½ ν•΄μ 
> LOCK.RELEASE batch_profile_sync scheduler1
(integer) 1
```

---

## β… ν…μ¤νΈ μ²΄ν¬λ¦¬μ¤νΈ

- [ ] λ¨λ“μ΄ μ •μƒμ μΌλ΅ λ΅λ“λλ”κ°€?
- [ ] CACHE.LOCKμ΄ λ™μ‹ μ”μ²­ μ‹ ν•λ‚λ§ "LOAD" λ°ν™ν•λ”κ°€?
- [ ] CACHE.SET ν›„ CACHE.GETμΌλ΅ κ°’μ„ μ΅°νν•  μ μλ”κ°€?
- [ ] TASK.PUBLISHλ΅ λ°ν–‰ν• μ‘μ—…μ΄ TASK.CONSUMEμΌλ΅ μ†λΉ„λλ”κ°€?
- [ ] μ—¬λ¬ Consumerκ°€ μ‘μ—…μ„ λ¶„μ‚° μ²λ¦¬ν•λ”κ°€?
- [ ] TASK.RETRYκ°€ μ •μƒ μ‘λ™ν•λ”κ°€?
- [ ] LOCK.ACQUIREκ°€ λ™μ‹ μ”μ²­ μ‹ ν•λ‚λ§ μ„±κ³µν•λ”κ°€?
- [ ] LOCK.RELEASEκ°€ μ¬λ°”λ¥Έ μ‹λ³„μλ§ ν—μ©ν•λ”κ°€?
- [ ] LOCK.EXTENDκ°€ μ •μƒ μ‘λ™ν•λ”κ°€?

---

## π› νΈλ¬λΈ”μν…

### λ¨λ“ λ΅λ“ μ‹¤ν¨
```bash
# μ—λ¬: ERR Error loading the extension
# ν•΄κ²°: redismodule.h κ²½λ΅ ν™•μΈ
ls -la ../redismodule.h

# μ¬λΉλ“
make clean
make
```

### λ…λ Ήμ–΄ μΈμ‹ μ• λ¨
```bash
# ν™•μΈ
redis-cli MODULE LIST

# λ¨λ“ μ–Έλ΅λ“ ν›„ μ¬λ΅λ“
redis-cli MODULE UNLOAD cachelock
redis-cli MODULE LOAD /path/to/cachelock.so
```

### μ„±λ¥ λ¨λ‹ν„°λ§
```bash
# Redis ν†µκ³„
redis-cli INFO stats

# λ…λ Ήμ–΄ μ‹¤ν–‰ νμ
redis-cli INFO commandstats
```

---

## π“ μμƒ κ²°κ³Ό

μ„±κ³µμ μΈ ν…μ¤νΈ μ™„λ£ μ‹:
- β… μΊμ‹ μ¤νƒ¬ν”Όλ“ λ°©μ§€: λ™μ‹ 100 μ”μ²­ μ‹ DB μ΅°ν 1νλ§
- β… μ‘μ—… ν: Consumer λ¶„μ‚° μ²λ¦¬ ν™•μΈ
- β… λ¶„μ‚° λ½: λ™μ‹ νλ“ μ‹λ„ μ‹ 1κ°λ§ μ„±κ³µ

μ¶•ν•ν•©λ‹λ‹¤! π‰
Redis κ³ κΈ‰ κΈ°λ¥ λ¨λ“μ΄ μ •μƒ μ‘λ™ν•©λ‹λ‹¤!
